In [1]:
import pandas as pd
import sys
sys.path.append("..")
from src import passwords as ps
from src import sp_analisis as sa

##  Ejercicio 1. Familiarizarse con la BBDD
![esquemaNorthwind](../data/esquemaNorthwind.png)

## Ejercicio 2. Primeras consultas

- ### ¿Cuántos empleados tenemos contratados en 'Global Importaciones'? Indica su id, nombre, apellido, ciudad y país.

In [2]:
query_employee = ''' SELECT  "employee_id", 
                              CONCAT("first_name", ' ', "last_name") AS "employee_name",
                              "city", 
                              "country"
                      FROM "employees";
                  '''
df_Employee= sa.pasos_querys(query_employee)
df_Employee

   employee_id     employee_name      city country
0            1     Nancy Davolio   Seattle     USA
1            2     Andrew Fuller    Tacoma     USA
2            3   Janet Leverling  Kirkland     USA
3            4  Margaret Peacock   Redmond     USA
4            5   Steven Buchanan    London      UK
5            6    Michael Suyama    London      UK
6            7       Robert King    London      UK
7            8    Laura Callahan   Seattle     USA
8            9    Anne Dodsworth    London      UK

In [14]:
print(f'En Global Importaciones tenemos contratados a {df_Employee["employee_id"].count()} personas')

En Global Importaciones tenemos contratados a 9 personas

- ### ¿Qué productos tenemos? Indica el id del producto, id del proveedor, nombre del producto, precio por unidad, unidades en stock, unidades pedidas al proveedor y productos descontinuados

In [5]:
query_products = ''' SELECT  "product_id",
                              "supplier_id",
                              "category_id",
                              "product_name",
                              "unit_price",
                              "units_in_stock",
                              "units_on_order",
                              "discontinued"
                      FROM "products";
                  '''
df_Products= sa.pasos_querys(query_products)
df_Products

,product_id,supplier_id,category_id,product_name,unit_price,units_in_stock,units_on_order,discontinued
0,1,8,1,Chai,18.00,39,0,1
1,2,1,1,Chang,19.00,17,40,1
2,3,1,2,Aniseed Syrup,10.00,13,70,0
3,4,2,2,Chef Anton's Cajun Seasoning,22.00,53,0,0
4,5,2,2,Chef Anton's Gumbo Mix,21.35,0,0,1
...,...,...,...,...,...,...,...,...
72,73,17,8,Röd Kaviar,15.00,101,0,0
73,74,4,7,Longlife Tofu,10.00,4,20,0
74,75,12,1,Rhönbräu Klosterbier,7.75,125,0,0
75,76,23,1,Lakkalikööri,18.00,57,0,0
76,77,12,2,Original Frankfurter grüne Soße,13.00,32,0,0

In [16]:
print(f'En Global Importaciones tenemos {df_Products["product_id"].count()} productos')

En Global Importaciones tenemos 77 productos

In [17]:
df_Products.to_csv('../data/products.csv', index=False)

- ### ¿Tenemos productos descontinuados?. Indica el nombre del producto, y cantidad que nos queda en stock.

In [8]:
query_discontinued = ''' SELECT "product_name",
                              "units_in_stock",
                              "discontinued"
                          FROM "products"
                          WHERE "discontinued" = 1;
                      '''
df_Products_discontinued = sa.pasos_querys(query_discontinued)
df_Products_discontinued

                    product_name  units_in_stock  discontinued
0                           Chai              39             1
1                          Chang              17             1
2         Chef Anton's Gumbo Mix               0             1
3                Mishi Kobe Niku              29             1
4                   Alice Mutton               0             1
5             Guaraná Fantástica              20             1
6              Rössle Sauerkraut              26             1
7        Thüringer Rostbratwurst               0             1
8  Singaporean Hokkien Fried Mee              26             1
9                  Perth Pasties               0             1

In [5]:
print(f'Tenemos {df_Products_discontinued ["discontinued"].count()} productos descontinuados')

Tenemos 10 productos descontinuados

- ### ¿Qué proveedores tenemos? Indica el id de la compañía, nombre de la compañía, ciudad y país.

In [9]:
query_suppliers = ''' SELECT "supplier_id",
                              "company_name",
                              "city",
                              "country"
                        FROM "suppliers"                    
                  '''

df_Suppliers = sa.pasos_querys(query_suppliers)
df_Suppliers

,supplier_id,company_name,city,country
0,1,Exotic Liquids,London,UK
1,2,New Orleans Cajun Delights,New Orleans,USA
2,3,Grandma Kelly's Homestead,Ann Arbor,USA
3,4,Tokyo Traders,Tokyo,Japan
4,5,Cooperativa de Quesos 'Las Cabras',Oviedo,Spain
5,6,Mayumi's,Osaka,Japan
6,7,"Pavlova, Ltd.",Melbourne,Australia
7,8,"Specialty Biscuits, Ltd.",Manchester,UK
8,9,PB Knäckebröd AB,Göteborg,Sweden
9,10,Refrescos Americanas LTDA,Sao Paulo,Brazil
10,11,Heli Süßwaren GmbH & Co. KG,Berlin,Germany
11,12,Plutzer Lebensmittelgroßmärkte AG,Frankfurt,Germany
12,13,Nord-Ost-Fisch Handelsgesellschaft mbH,Cuxhaven,Germany
13,14,Formaggi Fortini s.r.l.,Ravenna,Italy
14,15,Norske Meierier,Sandvika,Norway
15,16,Bigfoot Breweries,Bend,USA
16,17,Svensk Sjöföda AB,Stockholm,Sweden
17,18,Aux joyeux ecclésiastiques,Paris,France
18,19,New England Seafood Cannery,Boston,USA
19,20,Leka Trading,Singapore,Singapore
20,21,Lyngbysild,Lyngby,Denmark
21,22,Zaanse Snoepfabriek,Zaandam,Netherlands
22,23,Karkki Oy,Lappeenranta,Finland
23,24,"G'day, Mate",Sydney,Australia
24,25,Ma Maison,Montréal,Canada
25,26,Pasta Buttini s.r.l.,Salerno,Italy
26,27,Escargots Nouveaux,Montceau,France
27,28,Gai pâturage,Annecy,France
28,29,Forêts d'érables,Ste-Hyacinthe,Canada

In [7]:
print(f'Tenemos un total de {df_Suppliers["supplier_id"].count()} proveedores')

Tenemos un total de 29 proveedores

In [22]:
df_Suppliers.to_csv('../data/suppliers.csv', index=False)

- ### ¿Qué pedidos hemos tenido? Indica el número de pedido, id del cliente,id del transportista, dia del pedido, día requerido de llegada y día de llegada real.

In [10]:
query_orders = ''' SELECT "order_id",
                          "customer_id",
                          "ship_via",
                          "order_date",
                          "required_date",
                          "shipped_date"
                    FROM "orders"
               '''
df_Orders = sa.pasos_querys(query_orders)
df_Orders

     order_id customer_id  ship_via  order_date required_date shipped_date
0       10248       VINET         3  1996-07-04    1996-08-01   1996-07-16
1       10249       TOMSP         1  1996-07-05    1996-08-16   1996-07-10
2       10250       HANAR         2  1996-07-08    1996-08-05   1996-07-12
3       10251       VICTE         1  1996-07-08    1996-08-05   1996-07-15
4       10252       SUPRD         2  1996-07-09    1996-08-06   1996-07-11
..        ...         ...       ...         ...           ...          ...
825     11073       PERIC         2  1998-05-05    1998-06-02         None
826     11074       SIMOB         2  1998-05-06    1998-06-03         None
827     11075       RICSU         2  1998-05-06    1998-06-03         None
828     11076       BONAP         2  1998-05-06    1998-06-03         None
829     11077       RATTC         2  1998-05-06    1998-06-03         None

[830 rows x 6 columns]

In [24]:
df_Orders.to_csv('../data/orders.csv', index=False)

- ### ¿Cuántos pedidos hemos tenido?

In [25]:
print(f'Hemos tenido {df_Orders["order_id"].count()} pedidos')

Hemos tenido 830 pedidos

- ### ¿Cuántos clientes tenemos? Indica el id del cliente, nombre de la compañía, ciudad y país.

In [12]:
query_customers = ''' SELECT "customer_id",
                              "company_name",
                              "city",
                              "country"
                      FROM "customers"
                  '''
df_Customers = sa.pasos_querys(query_customers)
df_Customers

   customer_id                        company_name         city  country
0        ALFKI                 Alfreds Futterkiste       Berlin  Germany
1        ANATR  Ana Trujillo Emparedados y helados  México D.F.   Mexico
2        ANTON             Antonio Moreno Taquería  México D.F.   Mexico
3        AROUT                     Around the Horn       London       UK
4        BERGS                  Berglunds snabbköp        Luleå   Sweden
..         ...                                 ...          ...      ...
86       WARTH                      Wartian Herkku         Oulu  Finland
87       WELLI              Wellington Importadora      Resende   Brazil
88       WHITC                White Clover Markets      Seattle      USA
89       WILMK                         Wilman Kala     Helsinki  Finland
90       WOLZA                      Wolski  Zajazd     Warszawa   Poland

[91 rows x 4 columns]

In [10]:
print(f'Tenemos un total de {df_Customers["customer_id"].count()} clientes')

Tenemos un total de 91 clientes

In [28]:
df_Customers.to_csv('../data/customers.csv', index=False)

- ### ¿Con qué empresas de transporte trabajamos? Indica su id del transportista y el nombre de la compañía.

In [15]:
query_shippers = ''' SELECT "shipper_id",
                            "company_name"
                    From "shippers"                  
                  '''
df_Shippers = sa.pasos_querys(query_shippers)
df_Shippers

   shipper_id       company_name
0           1     Speedy Express
1           2     United Package
2           3   Federal Shipping
3           4  Alliance Shippers
4           5                UPS
5           6                DHL

In [30]:
print(f'Trabajamos con un total de {df_Shippers["shipper_id"].count()} empresas de transporte')

Trabajamos con un total de 6 empresas de transporte

In [31]:
df_Shippers.to_csv('../data/shippers.csv', index=False)

- ### ¿Cómo son las relaciones de reporte de resultados entre los empleados?

In [16]:
query_reports = ''' SELECT "employee_id",
                            CONCAT("first_name", ' ', "last_name") AS "employee_name",
                            "reports_to"
                      FROM "employees";    
                '''
df_Reports = sa.pasos_querys(query_reports)
df_Reports

   employee_id     employee_name  reports_to
0            1     Nancy Davolio         2.0
1            2     Andrew Fuller         NaN
2            3   Janet Leverling         2.0
3            4  Margaret Peacock         2.0
4            5   Steven Buchanan         2.0
5            6    Michael Suyama         5.0
6            7       Robert King         5.0
7            8    Laura Callahan         2.0
8            9    Anne Dodsworth         5.0

In [13]:
# Hago un self-join para obtener el nombre del supervisor
df_Reports = df_Reports.merge(df_Reports[['employee_id', 'employee_name']], 
                              left_on='reports_to', 
                              right_on='employee_id', 
                              how='left', 
                              suffixes=('', '_manager'))

# Renombro la columna con el nombre del supervisor
df_Reports.rename(columns={'employee_name_manager': 'manager_name'}, inplace=True)
df_Reports

,employee_id,employee_name,reports_to,employee_id_manager,manager_name
0,1,Nancy Davolio,2.0,2.0,Andrew Fuller
1,2,Andrew Fuller,NaN,NaN,NaN
2,3,Janet Leverling,2.0,2.0,Andrew Fuller
3,4,Margaret Peacock,2.0,2.0,Andrew Fuller
4,5,Steven Buchanan,2.0,2.0,Andrew Fuller
5,6,Michael Suyama,5.0,5.0,Steven Buchanan
6,7,Robert King,5.0,5.0,Steven Buchanan
7,8,Laura Callahan,2.0,2.0,Andrew Fuller
8,9,Anne Dodsworth,5.0,5.0,Steven Buchanan

In [14]:
# Contar cuántos empleados tiene cada supervisor
supervisores = df_Reports.groupby('manager_name')['employee_id'].count()

# Crear el mensaje para cada supervisor
for supervisor, num_empleados in supervisores.items():
    print(f'El supervisor {supervisor} tiene {num_empleados} empleados.')

El supervisor Andrew Fuller tiene 5 empleados.
El supervisor Steven Buchanan tiene 3 empleados.